using Game.Core.Common;
using Game.Core.Economy;

namespace Game.Core.Production
{
    /// <summary>
    /// Інтерфейс, що описує будівлю, яка виробляє ресурси на основі рецепту.
    /// Будівля має вхідні та вихідні склади для ресурсів, а також порти для візуалізації процесу виробництва.
    /// Вона може бути в різних станах (наприклад, виробляє, зупинена через брак ресурсів тощо) і має прогрес виробництва, який відображає,
    /// наскільки близько вона до завершення поточного циклу виробництва.
    /// </summary>
    public interface IBuilding
    {
        // Унікальний ідентифікатор будівлі
        BuildingId Id { get; }
        // Рецепт, який визначає, які ресурси потрібні для виробництва та які ресурси будуть вироблені
        Recipe Recipe { get; }

        // 2 склади
        // Вхідний склад для ресурсів, необхідних для виробництва
        IResourceContainer InputStorage { get; }
        // Вихідний склад для вироблених ресурсів
        IResourceContainer OutputStorage { get; }

        // “порти” для візуалізації: storage <-> building
        // Вхідний порт для візуалізації процесу виробництва (наприклад, для відображення ресурсів, що надходять до будівлі)
        IResourceContainer InPort { get; }
        // Вихідний порт для візуалізації процесу виробництва (наприклад, для відображення вироблених ресурсів, що виходять з будівлі)
        IResourceContainer OutPort { get; }

        // Статус будівлі, який визначає, чи вона виробляє, зупинена через брак ресурсів тощо
        BuildingStatus Status { get; }
        // Причина зупинки, якщо будівля не виробляє (наприклад, брак ресурсів, повний вихідний склад тощо)
        StopReason StopReason { get; }

        // Прогрес виробництва, який відображає, наскільки близько будівля до завершення поточного циклу виробництва.
        float ProductionProgress { get; } // 0..1 (тільки коли Producing)
    }
}